{
    "path": "buy-your-car",
    "description": "Car purchase mobile app prototype",
    "content": [
        {
            "title": "Concept and Problem",
            "detail": "<p>This assignment required a re-design of car purchase and browse applications and websites. Competitors I studied included the desktop and mobile versions of cargurus.com, truecar.com, cars.com, and carmax.com.</p>"
        },
        {
            "title": "Personas",
            "detail": "<p>Two personas I chose for this app varied based on their personalities and upcoming needs in finding a car with specific attributes and functionalities. I settled on the major differences of these personas being based on their marital and family status in addition to their occupations. For example, Jim was a married accountant with kids who needed to be able to carry more than five bodies in a car at a time. Alicia, on the other hand, was a single UX Designer fresh from graduation who was about to move more than 400 miles from home, with plans to visit every few months.</p>"
        },
        {
            "title": "Use Scenarios",
            "detail": "<p>Use Scenarios were created based on what the Personas would specifically be focusing on and which car attributes they would care about the most during a search for a car. The scenarios also detailed how they planned to share they results they found and with whom. For example, since Jim was married he wanted to be able to share his findings with his wife so that they could make a better decision together in buying a new car. On the other hand, due to Alicia's inexperience in purchasing a car, she needed to be able to share her results so that she could get suggestions from her parents on which results would be better options.</p>",
            "images": [
                {
                    "src": "projects/media/car-purchase/alicia_user_profile.png",
                    "alt": "Body of text with details of example use scenario",
                    "classes": "align-center",
                    "containerClasses": "mobile-width-100 width-45"
                },
                {
                    "src": "projects/media/car-purchase/jim_user_profile.png",
                    "alt": "Body of text with details of example use scenario",
                    "classes": "align-center",
                    "containerClasses": "mobile-width-100 width-45"
                }
            ]
        },
        {
            "title": "Context and Background",
            "detail": "<p>Finding a car involves numerous factors, from body type to model, color, and price. Putting so many options in one small view on a mobile phone can be overwhelming for users who have different priorities in what they are looking for in a car.</p><p>Therefore, I knew that if I had to display these many options to a user in one view, I should compact and emphasize the accessibility to the other navigational pieces in a page besides the options. These options included the “Sort” and “Favorites” pages that are the only two other pages with different purposes and functionalities:</p><ul><li>“Sort” allows you to organize the results by distance, price, or more</li><li>“Favorites” allows you to view saved search queries and results (favorite vehicles)</li></ul><p>Alongside the idea of the “Filter” – the car search query – these pages would always be available, sticky at the top of the app.</p><p>In addition, the “Filter” and “Sort” pages would have associated sticky links at the bottom:</p><ul><li>“Clear” functionality so that the user could quickly and easily restart their search</li><li>“Search” or “Save” functionality to view their results or save them to their favorites</li></ul><p>As a final note, the three major pages were divided by three different color shades for users to better understand how the page content differentiates from each other.</p>"
        },
        {
            "title": "Sketches",
            "detail": "<p>The sketches I created explored the way that the car purchase options and navigational links would look altogether as well as how results page would look. I even considered a UI in how the user could make a selection between car options that had three choices, such as the Condition Type (New, Used, Certified).</p><p>One other idea I explored in my sketches was allowing the user to choose what type of person they were: Did they already know exactly what they wanted, or did they just want to browse options? Ultimately, I decided that the direction that my app was taking didn’t require such a “fork in the road,” especially because I wanted all pages of the app to be as accessible as possible if they wanted to go back and forth.</p>",
            "images": [
                {
                    "src": "projects/media/car-purchase/prototype_drawing.png",
                    "alt": "Drawing of app user interface prototype",
                    "classes": "align-center",
                    "containerClasses": "mobile-width-100"
                }
            ]
        },
        {
            "title": "Wireframes and Prototype",
            "detail": "<p>Finally, I built wireframes based on my thoughts and sketches in Axure in order to better show the sticky functionality of the major navigational pieces, how the three major “pages” of the app were separate from each other yet still accessible, some basic UI ideas, as well as the general feel of the app as it would look in the palm of your hand.</p><p>Each wireframe was able to link and interact with each other to show the full experience of the Filter-Sort-Favorites functionality to the app.</p>",
            "buttons": [
                {
                    "title": "View the Prototype",
                    "classes": "align-center",
                    "url": "http://a391n8.axshare.com/iphone_frame_for_desktop_view.html"
                }
            ],
            "images": [
                {
                    "src": "projects/media/car-purchase/prototype_axure.png",
                    "alt": "User interface for low fidelity app prototype",
                    "classes": "align-center",
                    "containerClasses": "mobile-width-100 width-45"
                }

            ]
        }
    ]

}