{
    "path": "french-laundry-recipe-process-flow",
    "description": "Interaction Design and Information Architecture exercise",
    "content": [
        {
            "title": "About",
            "detail": "<p>For an Interaction Design and Information Architecture course. I chose to diagram the process of completing a recipe from the French Laundry Cookbook, specifically the <a target='_blank' href='https://books.google.com/books?id=mk7t2MNQBbUC&pg=PA25&lpg=PA25&dq=linguine+with+white+clam+sauce+french+laundry+cookbook&source=bl&ots=QnTWyqaDzp&sig=fjw0aMDGSVpiS3BESE1ME9WjIl0&hl=en&sa=X&ei=RTBYVfrLKdSwyASxvoHIAg&ved=0CCYQ6AEwAQ#v=onepage&q=linguine%20with%20white%20clam%20sauce%20french%20laundry%20cookbook&f=false'>\"Linguine\" with White Clam Sauce recipe</a> -- the process being one that I had witnessed and documented in photographs two months before starting this project.</p>"
        },
        {
            "title": "Division",
            "detail": "<p>The cooking process was broken up into three major stages:</p><ol><li>Food and instrument Preparation,</li><li>Ingredient combination and dish creation, and</li><li>Meal presentation</li></ol><p>(There was even the option to skip the whole cooking process in order to go straight to The French Laundry itself!)</p>"
        },
        {
            "title": "Illustration",
            "detail": "<p>Bubbled previews of photographs taken during the process provided an illustration of the flow in how the ingredients are slowly prepared individually and eventually combined to create new flavors.</p>"
        },
        {
            "title": "Color",
            "detail": "<p>In addition, color was used to indicate portions of the recipe process and how they differed from each other.</p><p>Gray, for example, represented background information, preparation, and the overall process.</p><p>Blue stood for the beginning and end of the process, before and after things actually get heated in the kitchen.</p><p>The most vibrant colors of all -- Red, Green, and Yellow -- represented three designated stages of the process that were necessary to perform independently yet simultaneously in order to complete the dish properly. Darker shades of Red and Green were further used to break down their many sub-tasks into more readable sub-categories.</p>",
            "images": [
                {
                    "src": "projects/media/french-laundry/diagram.jpeg",
                    "alt": "French Laundry recipe process flow diagram",
                    "classes": "align-center",
                    "containerClasses": "mobile-width-100"
                }
            ]
        }
    ]
}