{
    "path": "good-bad-graph-analysis",
    "description": "Analysis of different graphs across the Internet",
    "content": [
        {
            "detail": "<p>For an Information Visualization and Infographics exercise, I evaluated two graphs: one that was made effectively while the other was not.</p>"
        },
        {
            "title": "Good Graph",
            "detail": "<p>This color map graph is from an article by Chloe Whiteaker, Alex McIntyre, and Christopher Cannon. It’s from Bloomberg.com’s article <a target='_blank' href='http://www.bloomberg.com/graphics/2016-powerball-jackpot-payoff'>\"The Best and Worst States for Powerball Winners,\"</a> which was about the recent Powerball Lottery.</p>",
            "images": [
                {
                    "src": "projects/media/good-bad-graph/jackpot-map.jpeg",
                    "alt": "Lottery jackpot value graph across the U.S.",
                    "classes": "align-center",
                    "containerClasses": "mobile-width-100 width-75"
                }
            ]
        },
        {
            "subtitle": "What did the designer want me to do with this graphic?",
            "detail": "<p>This graph tries to explain the value of the $1.5 billion jackpot in each state of the U.S. If someone’s ticket were to match the 6 numbers drawn, including the Powerball number, these numbers would determine what that winner would win. This is dependent on the state in which the tickets were bought as well as state and federal taxes. Furthermore, it indicates where the lottery has the highest to lowest value as well as which states did not participate in the lottery. In particular, the designer would have wanted me as the reader to easily find where I’m from on the map in order to find out how much money I’d get if I won the jackpot. Once I did that, I could see how my state did in comparison with the rest of the United States by noticing how dark my state’s color is compared to the others. I could even see how my friends or family from other states would fare if they won. Finally, I could determine from the graph that the lighter the shade of green for a state, the higher their state taxes must be.</p><p>This graph is using Few’s classification as a geospatial chart. While it may not be considered as part of a ranking or nominal classification, it still displays a discrete set of values relative to each other and categorizes them with color based on highest to lowest number. Its variables include individual states of the U.S. and the final dollar amount after federal and state taxes in millions of dollars.</p><p>This was a great chart choice to depict how the lottery winnings fare better for some states rather than others along with how high or low our state taxes are across the board. Displaying this information in a geospatial chart makes it easier for readers to find their particular state. The graph could have also been great as a bar chart because it would indicate the rankings of the winnings from highest to lowest. However, illustrating the information on a map allows readers to more easily find states (especially their own states) by the common knowledge of where they would be geographically, and the color intensity makes it clear which states have the highest versus lowest winning amounts. It even opens up room for discussion on patterns: While the map may not have been classified by correlation, a reader can consider if the states with the highest jackpot winnings correspond to how low that state’s taxes tend to be.</p>"
        },
        {
            "subtitle": "How was Kosslyn's first goal of connecting with the audience upheld and/or violated?",
            "detail": "<p>This article’s audience includes people interested in how much the Powerball jackpot is really worth after taxes, especially those who have purchased lottery tickets (whether or not they thought their chances of winning were high). Some people tend to think it may not be “worth” buying into a lottery, but finding out how much you would actually get if you won could be something that convinces them to try it. More specifically, these would be Americans in states that are participating in the Powerball lottery.</p><p>This chart is therefore effective in connecting with the article’s audience, because it tells a reader the appropriate knowledge in that the $1.5 billion jackpot is actually worth millions of dollars after taxes. By showing each state’s specific winnings after taxes, the chart attracts a larger, national audience who can make the graph more relevant to them individually by looking at the numbers for their own state. It even allows the audience to compare themselves with other states.</p>"
        },
        {
            "subtitle": "How was Kosslyn's second goal of direct and hold attention upheld and/or violated? How was Kosslyn's third goal of promoting and understanding memory upheld and/or violated?",
            "detail": "<p>The graph clearly intends to show a geographical depiction of the United States. However, each state’s size is obviously not accurate, instead being represented as a square. Geographic location was prioritized over geographic size, which was not a necessary element in creating this chart anyway. This is one way that the graph was therefore salient by making an informative change in only displaying principal factors – all while still allowing the reader to discriminate between the different states as squares and perceptually understand that they represent their location on a map of the U.S.</p><p>The chart makes each detail purposeful enough that there is virtually no chart junk. In fact, the only issue that it may have is in a lack of footnote or title text to clarify if these numbers would be the same whether or not the winner chose to take the lump sum of the winnings.</p><p>By utilizing color intensity as shades of green, it’s easier to distinguish the range of higher to lower winning states. In addition, because the color intensity of states involved was based on one color, the graph clearly shows the reader that the gray states are not involved in the lottery because they are not even a shade of green.</p>"
        },
        {
            "title": "Bad Graph",
            "detail": "<p>This circle area graph, created by Javier Zarracina and Alvin Chang, comes from Vox.com’s political article <a target='_blank' href='http://www.vox.com/2015/9/28/9411243/donald-trump-tax-rich'>\"Don’t believe the hype. Donald Trump wants massive tax cuts for the rich,\"</a> written by Dylan Matthews.</p>",
            "images": [
                {
                    "src": "projects/media/good-bad-graph/vox-chart.jpeg",
                    "alt": "Circle area graph",
                    "classes": "align-center",
                    "containerClasses": "mobile-width-100 width-75"
                }
            ]
        },
        {
            "subtitle": "What did the designer want me to do with this graphic?",
            "detail": "<p>What the graph tries to explain is how obvious it is that Donald Trump wants higher tax cuts for the rich as opposed to what Jeb Bush is calling for. It’s also trying to indicate that Trump wants higher tax cuts than Bush for every percentile of the American population except for the lowest 20%.</p><p>The author is using Few’s classifications of ranking by showing how tax cuts are larger for one income class over another. It could be argued that there is a correlation where, as the average income increases, the tax cut increases as well. However, the tax cut increases more as qualifying categories than as a point-to-point correlation between a specific tax cut percentage and a specific income dollar amount.</p><p>The variables represented include the average income class, the candidates involved who are applying tax cutes, and the average tax cuts applied by the candidates to the different classes.</p><p>As a whole, the use of circles to denote the differences between the sizes does not make the differentiation obvious. If the authors really wanted to use circles, they could have at least one enveloping the other to show how much more incremental that Trump was to Bush. Additional options for this graph could have included a bar chart to compare the candidates side by side, from the top down. A stacked column or bar chart could have also shown how much higher that Trump’s tax cuts were than Bush’s as a whole (except for the Lowest 20%). Combining these options with the following visual, functional, and organizational suggestions would have made the chart more understandable within seconds.</p>"
        },
        {
            "subtitle": "How was Kosslyn's first goal of connecting with the audience upheld and/or violated?",
            "detail": "<p>The audience of this article was, at the very least, those interested in who would be the Republican candidate for the 2016 election (either Bush or Trump). This could be Republican supporters or even non-Republicans wondering who would run against the Democratic candidate. In addition, the article was probably written for middle-class Americans or at least readers who are not in the Top 1% income class since the article says “don’t believe the hype” that Trump’s tax cut plan provide “relief” for the middle class. One final point about the audience is that the analysis that led to this graph was by the “left-leaning” Citizens for Tax Justice, as the article itself indicates.</p><p>Therefore, this graph was probably created for an audience of more liberal readers (who already understand that Republicans usually want higher tax cuts for the more wealthy) and could be in the middle class. And while the graph makes this clear by using the largest tax cut circles for the Top 1%, it is not as clear to the audience whether Bush or Trump wants the higher tax cuts across the different income classes, especially the middle class.</p>"
        },
        {
            "subtitle": "How was Kosslyn's second goal of direct and hold attention upheld and/or violated? How was Kosslyn's third goal of promoting and understanding memory upheld and/or violated?",
            "detail": "<p>While the graph may have been salient in indicating that the higher the income, the higher the tax cut, the more important question was the contrast between the two candidates. The chart was not discriminable in describing this at a glance. Perceptually, I may understand the categories of each set of cirlcles, but they require the reader to focus on which of the two circles per category is actually larger. If anything it would have been helpful if the circles were more side by side (less separated) or even enveloping each other (more grouped).</p><p>Chart junk for this graph came in the form of unnecessary text used for duplicating category titles, such as Average Cuts, Average Income, or even the names of each class category. Instead of duplicate text to define categories, the graph’s organization could have been more of a table-like approach with “merged cells” indicating the set of Average Incomes or Class Categories as rows and that the columns are representing the tax cuts.</p><p>The graph also lists two sets of average incomes, one per candidate. This could be additional information unnecessary to the greater argument. However, to reduce junk text, the chart could have instead listed the ranges of each class category such as $15000-15600 or$1.73-1.79 million – especially since Trump’s average income number tends to be higher.</p>"
        },
        {
            "subtitle": "How was Kosslyn's third goal of promoting and understanding memory upheld and/or violated?",
            "detail": "<p>Regarding compatibility, it’s very unclear whether one candidate’s tax cuts are larger than the other’s, or even if the candidate’s tax cut is larger or the same as the graph goes through each income class – especially true when looking at Bush’s numbers.</p><p>The dollar numbers (or percentages) are different across the board and thus are more informative than the circle visuals. Along with this, the conventional understanding of income classes is that they are high, middle, and low. Therefore, there could have been a better visual divider between the three major classes, such as background color hues.</p><p>A final note about the visual perception of the graph would be that it follows a reader’s natural top-down approach to analyzing graphs. The Top 1% may be the most dramatic part of the graph, which may be why it’s at the bottom, but if it’s the first thing that readers notice anyway then the graph categories might as well be reversed. That way, the literally Lowest 20% category is dramatized as the lesser acknowledged class regarding the tax cuts.</p>"
        },
        {
            "subtitle": "Graph Recommendations",
            "detail": "<p>The following sketches address the problems that the current graph has by placing Bush’s and Trump’s tax cut numbers closer to each other for better comparison, including more visual cues such as texture or color shades that better categorize the information, and reducing the extra textual junk that was on the chart. A bar chart may be best for this, especially with the change to a top-down approach, but a stacked bar or column chart could also better show both candidates’ tax cuts in total. Additionally, there is a sketch recommendation that the original Area Chart could look slightly better if the circles enveloped each other.</p>",
            "images": [
                {
                    "src": "projects/media/good-bad-graph/graph-recommendation.jpeg",
                    "alt": "Examples of recommended bar charts and circle area graphs",
                    "classes": "align-center",
                    "containerClasses": "mobile-width-100 width-75"
                }
            ]
        }
    ]
}