{
    "path": "how-bout-that-weather",
    "title": "How 'Bout that Weather?",
    "description": "Messaging app extension that allows users to notice the weather while making plans",
    "content": [
        {
            "title": "Concept and Problem",
            "detail": "<p>For a Prototyping and Implementation course. This assignment required that the <strong>weather</strong> be incorporated into a mobile app. Considerations of how the weather could be inserted into an app included dining and event, wardrobe, and even recipe mobile apps. However, I was most enthusiastic upon realizing a useful way that the weather could be incorporated into one of the most frequently used applications on mobile phones: Messaging.</p><p>The idea behind this concept was based on the already existing functionality of the iOS iMessages in how the app will recognize dates and times in conversation and point them out -- with subtlety -- to the user, who then has the option to add those dates and times to their calendar. One step further, through this assignment, the app would have two requirements:</p><ul><li>Functionally recognize dates, times, and location in conversations and refer to the associated Weather App for for more information</li><li>Refer this useful information in a way that's just as subtle as its current date/time-only functionality</li>",
            "images": [
                {
                    "src": "projects/media/weather/sketch_example.png",
                    "alt": "Sketch of idea as a messaging scenario",
                    "classes": "align-center",
                    "containerClasses": "mobile-width-100 width-45"
                }
            ]
        },
        {
            "title": "Sketching Scenario and Flow",
            "classes": "clear-line",
            "detail": "<p>The spark for this idea came from a casual conversation with someone who told me about his events from the past weekend and how he and his friends didn't realize that it would be raining while they visited Disneyland. I thought about how he could very well have changed plans, or at least have been more prepared, had he known what the weather would be like that day. And I further pictured how that planning conversation must have happened and how it could have happened had they known what the weather would be like.</p><p>So many plans are made in conversation, both physically and digitally. Messaging apps are what foster that conversation, and the intelligence within them can already recognize date and time in relation to scheduling.</p><p>Date and time can also further be associated with the weather. If the app functionality could recognize location in conversation as well, then the weather could be more specified in its notification. This was where I brainstormed on the kind of language that could be recognized by the app in conversations as mentions of location in relation to date and time.</p><p>This was where I mapped the necessary flow of the user's interaction with everyday messaging app use. The user would always be in either her Messaging App or her phone's associated Weather App. This was assuming that, as on iOS, there is an unremovable Weather app. If a user's dialog in her Messaging app was Weather-recognizable, there would be notification of that within the app conversation. This notification should provide enough basic information about the weather. However, if the user wanted to know more, she could use that notification to take her to the Weather app for more detail.</p>",
            "images": [
                {
                    "src": "projects/media/weather/scenarios_vocabulary.png",
                    "alt": "Original notes written about scenarios and vocabulary that would trigger app extension",
                    "classes": "align-center",
                    "containerClasses": "mobile-width-100 width-75"
                },
                {
                    "src": "projects/media/weather/sketch_flow.png",
                    "alt": "Sketch of user flow for experiencing weather app extension",
                    "classes": "align-center",
                    "containerClasses": "mobile-width-100 width-75"
                }
            ]
        },
        {
            "title": "Paper Prototype of User Interface Options",
            "classes": "clear-line",
            "detail": "<p>A paper prototype was created to explore the different User Interface options for the notification of the weather within the Messaging app. These ideas included:</p><ul><li>An A.I. member of the conversation piping in to dictate the weather conditions</li><li>A block of text in the middle of the conversation to state weather conditions</li><li>A brief summary block using a combination of both text and imagery</li><li>An icon to represent the weather in pictures</li></ul>",
            "images": [
                {
                    "src": "projects/media/weather/ui_options.gif",
                    "alt": "Paper prototype example illustrating the different options for how to display a weather indicator, including text-based messaging versus icon-based indicators.",
                    "classes": "align-center",
                    "containerClasses": "mobile-width-100 width-45"
                }
            ]
        },
        {
            "title": "Interactive Prototype",
            "classes": "clear-line",
            "detail": "<p>Ultimately, I decided to choose a UI combination that would be both subtle and as non-interfering as possible to the user but could still be informational to her if she would like to learn more.</p><p>Therefore, the final prototype provided information in the following ways:</p><ol><li>A simple icon next to Messaging dialog bubbles to give a quick notification of the weather, when date/time/location were mentioned</li><li>A more informational weather summary upon holding down the weather icon, mentioned above</li><li>A transition to the Weather App itself when pressing the weather icon itself</li></ol>",
            "buttons": [
                {
                    "title": "View the Prototype",
                    "classes": "align-center",
                    "url": "https://emhgau.axshare.com/#p=iphone_frame_for_desktop_view"
                }
            ],
            "images": [
                {
                    "src": "projects/media/weather/prototype_animation.gif",
                    "alt": "Animation showing a user's interaction with the prototype, including the tapping of the two weather indicators as well as clicking the weather detail in order to go to the weather app.",
                    "classes": "align-center",
                    "containerClasses": "mobile-width-100 width-45"
                }
                
            ]
        },
        {
            "title": "Presentation",
            "classes": "clear-line",
            "detail": "<p>View the presentation of the process and final prototype below.</p>",
            "video": "https://player.vimeo.com/video/118102051?h=79147c4118"
        }
    ]

}