{
    "path": "inkformation",
    "description": "Tattoo informational website information architecture",
    "content": [
        {
            "detail": "<p>For an Information Architecture and Interaction Design course, this project gave us the opportunity to choose a subject to pursue as a new or redesigned online experience. The topic chosen was based on an interest I personally have in tattoos and how I noticed a lack of centralized and reliable information on the web.</p>",
            "images": [
                {
                    "src": "projects/media/inkformation/inkformation.png",
                    "alt": "Wireframe depicting site homepage",
                    "classes": "align-center",
                    "containerClasses": "mobile-width-100"
                }
            ]
        },
        {
            "title": "Site Proposal",
            "detail": "<p>We began with a proposal that explained the need for such a website in the present day:</p><i>Tattoos have a rich cultural and social history that is layered so deeply with varying artistic styles, subjective meanings, and opinions that range from body defacement to practices of reverence. While plenty of celebrities are known today to have significant tattoos, others have become famous because of them. There is also a stigmatization of tattoos that includes arguments about their permanence and damage. Still, the practice of tattooing as body modification dates back to ancient cultures and beliefs that many may not even know or fully comprehend -- the ignorance of which can cause people today to tattoo themselves with misinterpreted symbols, thereby being disrespectful to other cultures.</i><p>After our competitive analysis, we then concluded that a site was necessary that could provide accurate and reliable information about tattoos that's relevant to today's cultural interests and misgivings about getting inked:</p><i>The mission of the Tattoo Information Site is to provide a hub for those experienced with or curious about getting tattoos in order to discover more about the numerous designs and styles as well as make better decisions in getting them.</i>"
        },
        {
            "title": "Personas",
            "detail": "<p>The personas we created were based on the intention for our users to include those getting ready to get their umpteenth tattoo to those who were curious about getting one for the first time.</p>",
            "images": [
                {
                    "src": "projects/media/inkformation/persona1.png",
                    "alt": "Details about first example persona",
                    "classes": "align-center",
                    "containerClasses": "mobile-width-100 width-45"
                },
                {
                    "src": "projects/media/inkformation/persona2.png",
                    "alt": "Details about second example persona",
                    "classes": "align-center",
                    "containerClasses": "mobile-width-100 width-45"
                }
            ]
        },
        {
            "title": "Card Sort",
            "detail": "<p>Using open card sorting was more efficient and appropriate in allowing potential users to provide their own vocabulary to describe their groups. Therefore, the Tattoo Information Site team used Concept Codify, an online card sorting tool, for a high number of participants and easier analysis. The team set up the tool using random content and subject “words” related to tattoos in some way. The reason behind setting up the tool with random content rather than the content inventory was to compare the category names participants suggested with the main navigation the team proposed in the content inventory.</p><p>From the card sorting results, the team mapped the new category names with the content inventory and modified some of these names to make them inline with users expectation and experience.</p>",
            "images": [
                {
                    "src": "projects/media/inkformation/cardsort.png",
                    "alt": "Card sorting diagram of different tattoo-related vocabulary words to use on the website",
                    "classes": "align-center",
                    "containerClasses": "mobile-width-100"
                }
            ]
        },
        {
            "detail": "<p>The main content in the first level of the website was the following:</p><ol><li><strong>Design</strong>: In this section, users would have the chance to learn more about the various styles and symbols of tattoos, and their various meaning. In addition, users can browse the different tattoo fonts and their scripts as well as the different symbols that are specify for specific body parts.</li><li><strong>Care and Safety</strong>: Users can increase their knowledge about the tattoo safety in terms of what they have to do before getting a tattoo, during the tattoo process, and after getting a tattoo.</li><li><strong>Shop and Artists</strong>: The Tattoo Information Site provides references on vast number of tattoo artists and shops. Users can view the different shops images and locations as well as the artists information and background. In addition, the website shows the different tattoo prices to inform users about the different price levels of various type of tattoos.</li><li><strong>Trends and Culture</strong>: Users who have limited knowledge about getting tattoos would have the chance to learn more about the tattoo history in different cultures, the reasons behind getting tattoos, and the most recent trends of tattoo though celebrities different tattoos images.</li><li><strong>Community</strong>: Users can read others experience with getting tattoos and browsing the Tattoo Information Site as well as share their personal experience.</li><li><strong>FAQs</strong>: Users can read multiple questions that are either general about tattoos or the website or questions that are more specific on health issues and shop locations.</li><li><strong>Login</strong>: Users can register in the Tattoo Information Site, and be member to receive notification about the new tattoo trends, reminders about any tattoo appointments they would have in the near future, and other new reviews about tattoo symbols they are interested in.</li><li><strong>Social Media</strong>: Users can share their experience with others using social media such as Facebook, Twitter, etc.</li><li><strong>Search</strong>: Users would have the chance to search about any tattoo symbols, designs, and artists easily using the search function.</li></ol>"
        },
        {
            "title": "Site Map",
            "detail": "<p>The following site map indicates the intended organization of the site's categories based on the card sort activity.</p>",
            "images": [
                {
                    "src": "projects/media/inkformation/sitemap.png",
                    "alt": "Map diagram of general site structure based on different informational sections",
                    "classes": "align-center",
                    "containerClasses": "mobile-width-100"
                }
            ]
        },
        {
            "title": "Mood Board",
            "detail": "<p>The Mood Board brought together a collection of photographs and images that represented the kind of appropriate information we wanted to include in the website, from the varying designs and styles of tattoos and places to get them to the different kinds of people who wear them.</p>",
            "images": [
                {
                    "src": "projects/media/inkformation/moodboard.png",
                    "alt": "Mood board with different tattoo-related imagery to give the general idea for the style associated with the website",
                    "classes": "align-center",
                    "containerClasses": "mobile-width-100 width-75"
                }
            ]
        },
        {
            "title": "Usability Testing and Wireframes",
            "detail": "<p>The objective of our group’s user testing was to find the design flaws, enhance ease-of-use, and create functionality for our tattoo informational site Inkformation. Our research group sought to understand the behaviours of our subjects by conducting task-oriented usability tests.</p><p>Before we conducted our user-tests we designed a few wireframes based on our site map. The wireframes functioned as a bare-bones simulation of a user’s online experience. For our tests we asked our five participants to navigate through a set of wireframes based on a series of tasks assigned to them. While the subjects work on completing these tasks we observed them and recorded their actions. After they were finished we asked them a few questions regarding their experience.  We analyzed our findings to search for common trends.</p><p>We finalized edits to our wireframes based on our participants' feedback during our user testing.</p>",
            "images": [
                {
                    "src": "projects/media/inkformation/wireframe1.jpg",
                    "alt": "Wireframe for the site homepage",
                    "classes": "align-center",
                    "containerClasses": "mobile-width-100 width-45",
                    "windowWrapper": "browser",
                    "browserDestination": "inkformation.com"
                },
                {
                    "src": "projects/media/inkformation/wireframe2.jpg",
                    "alt": "Wireframe for the site design page",
                    "classes": "align-center",
                    "containerClasses": "mobile-width-100 width-45",
                    "windowWrapper": "browser",
                    "browserDestination": "inkformation.com/designs"
                },
                {
                    "src": "projects/media/inkformation/wireframe3.jpg",
                    "alt": "Wireframe for the site symbols page",
                    "classes": "align-center",
                    "containerClasses": "mobile-width-100 width-45",
                    "windowWrapper": "browser",
                    "browserDestination": "inkformation.com/symbols"
                },
                {
                    "src": "projects/media/inkformation/wireframe4.jpg",
                    "alt": "Wireframe for the site shops and artists page",
                    "classes": "align-center",
                    "containerClasses": "mobile-width-100 width-45",
                    "windowWrapper": "browser",
                    "browserDestination": "inkformation.com/shops-and-artists"
                },
                {
                    "src": "projects/media/inkformation/wireframe5.jpg",
                    "alt": "Wireframe for the site trends and culture page",
                    "classes": "align-center",
                    "containerClasses": "mobile-width-100 width-45",
                    "windowWrapper": "browser",
                    "browserDestination": "inkformation.com/trends-and-culture"
                },
                {
                    "src": "projects/media/inkformation/wireframe6.jpg",
                    "alt": "Wireframe for the site preparation page",
                    "classes": "align-center",
                    "containerClasses": "mobile-width-100 width-45",
                    "windowWrapper": "browser",
                    "browserDestination": "inkformation.com/preparation"
                },
                {
                    "src": "projects/media/inkformation/wireframe7.jpg",
                    "alt": "Wireframe for the site community page",
                    "classes": "align-center",
                    "containerClasses": "mobile-width-100 width-45",
                    "windowWrapper": "browser",
                    "browserDestination": "inkformation.com/community"
                }
            ]
        },
        {
            "title": "Conclusion",
            "detail": "<p>Based on our findings we learned that most of the users were favorable of the idea of a destination such as Inkformation, and that a comprehensive site about tattoos seems interesting. There were some levels of difficulty or help needed during most of the user tests. There also seems to be a concern over layout and navigation consistency, a couple of users felt that some of the menu options had synonymous titles, while others believed that sections of the site should have been consolidated.</p><p>For future Inkformation wireframes, our group intends on creating more uniformity between all of the level 1 pages. We also intend on improving the navigation of some of the pages that contained a lot of information.</p>",
            "images": [
                {
                    "src": "projects/media/inkformation/report1.png",
                    "alt": "Presentation slide introduction",
                    "classes": "align-center",
                    "containerClasses": "mobile-width-100 width-45"
                },
                {
                    "src": "projects/media/inkformation/report2.png",
                    "alt": "Presentation slide about competitive analysis",
                    "classes": "align-center",
                    "containerClasses": "mobile-width-100 width-45"
                },
                {
                    "src": "projects/media/inkformation/report3.png",
                    "alt": "Presentation slide about site content",
                    "classes": "align-center",
                    "containerClasses": "mobile-width-100 width-45"
                },
                {
                    "src": "projects/media/inkformation/report4.png",
                    "alt": "Presentation slide about card sort",
                    "classes": "align-center",
                    "containerClasses": "mobile-width-100 width-45"
                },
                {
                    "src": "projects/media/inkformation/report5.png",
                    "alt": "Presentation slide about wireframe early versions",
                    "classes": "align-center",
                    "containerClasses": "mobile-width-100 width-45"
                },
                {
                    "src": "projects/media/inkformation/report6.png",
                    "alt": "Presentation slide about wireframe early versions including drawings",
                    "classes": "align-center",
                    "containerClasses": "mobile-width-100 width-45"
                },
                {
                    "src": "projects/media/inkformation/report7.png",
                    "alt": "Presentation slide about usability tests",
                    "classes": "align-center",
                    "containerClasses": "mobile-width-100 width-45"
                },
                {
                    "src": "projects/media/inkformation/report8.png",
                    "alt": "Presentation slide about mood board",
                    "classes": "align-center",
                    "containerClasses": "mobile-width-100 width-45"
                },
                {
                    "src": "projects/media/inkformation/report9.png",
                    "alt": "Presentation slide about site map",
                    "classes": "align-center",
                    "containerClasses": "mobile-width-100 width-45"
                },
                {
                    "src": "projects/media/inkformation/report10.png",
                    "alt": "Presentation slide about revised content",
                    "classes": "align-center",
                    "containerClasses": "mobile-width-100 width-45"
                },
                {
                    "src": "projects/media/inkformation/report11.png",
                    "alt": "Presentation slide about designs and wireframe changes",
                    "classes": "align-center",
                    "containerClasses": "mobile-width-100 width-45"
                },
                {
                    "src": "projects/media/inkformation/report12.png",
                    "alt": "Presentation slide about more wireframe changes",
                    "classes": "align-center",
                    "containerClasses": "mobile-width-100 width-45"
                },
                {
                    "src": "projects/media/inkformation/report13.png",
                    "alt": "Presentation slide about homepage wireframe changes",
                    "classes": "align-center",
                    "containerClasses": "mobile-width-100 width-45"
                }

            ]
        }
    ]
}