{
    "path": "sears-mobile",
    "description": "Responsive tablet and smartphone wireframes.",
    "content": [
        {
            "detail": "<p>For a Mobile Design course, I had the opportunity to design the mobile experience for a particular Sears.com product page about a Kenmore Gas Grill. I created one tablet and one smartphone wireframe to best display and structure the most appropriate information for the intended users of the site.</p>",
            "images": [
                {
                    "src": "projects/media/sears-mobile/sears_webpage.png",
                    "alt": "Sears.com webpage for gas grill",
                    "classes": "align-center",
                    "containerClasses": "mobile-width-100"
                }
            ]
        },
        {
            "title": "Wireframes",
            "detail": "<p>Navigation for both designs aims to have only 3 major links: Search, Cart, and Site Categories associated with the Sears Logo. This allows the navigation to take up as little height space as possible. The tablet design in particular has anchor links so that users can more easily navigate through the page. The tablet and mobile designs rely heavily on modal triggers so that they can view more options or do more tasks but in a separate space that doesn’t clutter the initial, prioritized page items that they will see.</p><p>Both the mobile and tablet designs place all recommended product sections toward the bottom of the page. This is because, with the smaller screens, it’s easier to find relevant page content toward the top. Furthermore, it’s easier to understand that the specific recommended product section a user may be searching for is somewhere toward the bottom instead of searching through every other page section. Furthermore, the mobile and tablet designs also focus on making the recommended product sections have their heights match the page’s height so that a user can easily swipe through one section to another instead of scrolling through individual products within the section — as if each section represents a piece of a vertical carousel.</p><p>The page design for the tablet aims to reflect some of the page layout functionality of the desktop design in that the Price details remain sticky on the right side of the page while the rest of the product details and recommended products take up most of the space on the page. However, what’s different here is that recommended products will take up the full width, essentially unsticking the Price Details since they do not describe any part of the recommended products.</p><p>Finally, the page design for mobile focuses on placing as many of the Product Pricing/Offer details toward the top as a quick summary of the product above the fold, while the other product details are below the fold but in easy access as dropdown sections that can be opened up by the user.</p>"
        },
        {
            "subtitle": "Tablet",
            "images": [
                {
                    "src": "projects/media/sears-mobile/sears_tablet.jpeg",
                    "alt": "Sears tablet wireframe",
                    "classes": "align-center",
                    "containerClasses": "mobile-width-100 width-45",
                    "windowWrapper": "device"
                },
                {
                    "src": "projects/media/sears-mobile/sears_tablet_annotated.jpeg",
                    "alt": "Sears tablet wireframe annotated",
                    "classes": "align-center",
                    "containerClasses": "mobile-width-100 width-45"
                }
            ]
        },
        {
            "subtitle": "Mobile",
            "images": [
                {
                    "src": "projects/media/sears-mobile/sears_mobile.jpeg",
                    "alt": "Sears mobile wireframe",
                    "classes": "align-center",
                    "containerClasses": "mobile-width-100 width-45",
                    "windowWrapper": "device"
                },
                {
                    "src": "projects/media/sears-mobile/sears_mobile_annotated.jpeg",
                    "alt": "Sears mobile wireframe annotated",
                    "classes": "align-center",
                    "containerClasses": "mobile-width-100 width-45"
                }
            ]
        }
    ]

}