{
    "path": "the-drawing",
    "description": "Short film production assistance and website design",
    "content": [
        {
            "detail": "<p>I had the opportunity to assist during the production for a short film called <em>The Drawing</em> from Site B Productions (which got me <a href='https://www.imdb.com/name/nm15845000'>my first IMDB credit</a>!). I worked with this company before in building the website for its previous feature film, <a href='/#/projects/northwood-pie'><em>Northwood Pie</em></a>, and was now asked to build the site for this short horror film.</p><p>The site was built on Squarespace -- with some adjustments made through HTML, CSS, and JavaScript -- to allow for future non-developers to edit in more easily when needed in the future. The content hierarchy was set up to prominently feature watching the short film on YouTube first, followed by mentioning the accolades/festivals it was featured in, the cast and crew, and other areas on the Internet where the short was mentioned -- intermixed with stills from the short to illustrate its horror elements and cinematography. The social networks mentioned included a custom Letterboxed link. The site content was optimized for accessibility and SEO -- including heading structure, image alt text, and schema/JSON-LD.</p>",
            "images": [
                {
                    "src": "projects/media/the-drawing/desktop.png",
                    "alt": "Presentation slide about homepage wireframe changes",
                    "classes": "align-center",
                    "containerClasses": "mobile-width-100",
                    "windowWrapper": "browser",
                    "browserDestination": "thedrawingmovie.com"
                },
                {
                    "src": "projects/media/the-drawing/mobile.png",
                    "alt": "Presentation slide about homepage wireframe changes",
                    "classes": "align-center",
                    "containerClasses": "mobile-width-100 width-45",
                    "windowWrapper": "device"
                }
            ],
            "buttons": [
                {
                    "title": "Check Out the Website",
                    "classes": "align-center see-all mobile-width-100 width-20",
                    "url": "https://www.thedrawingmovie.com"
                },
                {
                    "title": "Watch the Short Film",
                    "classes": "align-center see-all mobile-width-100 width-20",
                    "url": "https://www.youtube.com/watch?v=EbaAmzjjivo"
                }
            ]
        }
    ]
}