{
    "path": "twitter-print-infographic",
    "description": "Information Visualization and Infographics exercise",
    "content": [
        {
            "detail": "<p>My partner and I got to create a print infographic for our Information Visualization class. We found a dataset online that includes records of <a target='_blank' href='https://www.kaggle.com/datasets/crowdflower/twitter-airline-sentiment'>thousands of Tweets sent toward or about U.S. Airlines</a> in the span of one week in 2015.</p><p>This project was pretty fun! Here was our infographic and analysis essay.</p>",
            "images": [
                {
                    "src": "projects/media/twitter/print-infographic.jpeg",
                    "alt": "Infographic of Twitter sentiment data",
                    "classes": "align-center",
                    "containerClasses": "mobile-width-100"
                }
            ]
        },
        {
            "detail": "<p>Our infographic explores the different factors that made up 14,640 Tweets created in response to six American airlines services. This took place in a little over a week, February 16-24, 2015. The major element of this data was in describing the sentiment of these Tweets, from positive, neutral, to negative feelings toward the airlines -- broken down even further by categories of negative sentiment, such as if a customer experienced a late flight or booking problem. What we found is that a majority of the Tweets were negative, which is why the data was important in breaking down how poorly each airline may have been and why. This is why a majority of the charts in our infographic focus on the negative aspects of the Tweets.</p>"
        },
        {
            "title": "What did the designer want me to do with this graphic?",
            "detail": "<p>The intention for the reader of this graphic was to better understand how Twitter users feel about their airline experiences, which airlines had better or worse Twitter sentiments, how frequently these different sentiments took place across time, and the causes, categories, and words of those Tweets and Twitter sentiments. Specifically, the questions we wanted to answer were:</p><ul><li>Which airlines receive the best to worst sentiment?</li><li>Which airlines receive the most Tweets?</li><li>What locations produce the most Tweets?</li><li>What is the distribution of Tweets by sentiment?</li><li>What are the most common negative sentiment reasons?</li><li>What is the reason for an airline’s negative sentiment?</li><li>What Tweets have had the most popularity/notice, based on their number of Retweets?</li></ul><p>The infographic represents several variables across six charts:</p><ol><li>The <strong>stacked bar graph</strong> of Sentiment by Airline is a Ranking, Part-to-Whole, and Nominal Comparison graph with the variables of Airline Sentiment (ordinal), Airline Names (nominal), and Frequency in Number of Tweets (ratio). This shows which airlines received the best to worst sentiment as well as the most Tweets.</li><li>The <strong>bar graph</strong> of Airlines’ Top Reasons for Negative Sentiment is a Distribution graph with the variables of Airline Names (nominal), Negative Reason/Category (nominal), and Frequency in Number of Tweets (ratio). This presents the most common negative sentiment reasons, across each airline.</li><li>The <strong>bar graph</strong> of Most Common Reasons for Negative Sentiment is a Ranking and Distribution graph with the variables of Negative Reason/Category (nominal) and Frequency in Number of Tweets (ratio). This explains the most common negative sentiment reasons.</li><li>The <strong>line graph</strong> of Sentiment Over Time is a Time Series and Distribution graph with the variables of Airline Sentiment (ordinal), Frequency in Number of Tweets (ratio), and Date of Tweet (continuous interval). This illustrates the distribution of Tweets by sentiment over the selected time period.</li><li>The <strong>pie chart</strong> with proportions of Sentiment Breakdown is a Part-to-Whole graph with the variables of Airline Sentiment (ordinal) and Frequency in Number of Tweets (ratio). It helps explain what was the distribution of Tweets by sentiment.</li><li>The <strong>word cloud</strong> of Most Common Negative Words is a Ranking chart with the variables of Tweet Content (nominal) and Frequency of the words in said Content (ratio). This further supports the reasons for the high frequency of negative sentiment in the Tweets in the data.</li></ol><p>We also include a section with the two Most Retweeted Negative Sentiments. This shows which Tweets had the most popularity and notice, based on their number of Retweets, as well as an idea of the reasons why they were Retweeted and of negative sentiment. These two Tweets also happened to be about Customer Service and a Late Flight, reflecting the top negative categories mentioned in the other graphs.</p>"
        },
        {   "title": "Audience Connection",
            "detail": "<p>The intended audience is users of Twitter or other social media platforms who are curious how social media can be used by customers to express their feelings, opinions and experiences about a company. Additionally, this data presentation is targeted toward airline travelers who may commonly experience similar sentiments about service and airline quality, flight attendants, or the flights themselves. The reader should understand that Tweets can have a particular positive, neutral or negative sentiment, which can be spread through social media networks.</p>"
        },
        {
            "title": "Visual Design",
            "detail": "<p>The infographic’s set of charts utilize two colors: gray and blue. Shades of gray are used to indicate either positive or neutral sentiment while shades of blue marked negativity. This blue in particular comes from Twitter’s own branding to remind the user of the subject of the infographic.</p><p>The use of blue to indicate negativity is useful in indicating to the reader, which graphs pertain to negative sentiment. This is used in graphs comparing negative sentiment to positive and neutral sentiment as well as in the “Top Reasons” graph that has other shades of blue to show that it’s a chart solely about negativity.</p><p>The infographic grid as a whole tells its story horizontally, beginning with a section dedicated to breaking down the Sentiment by Airlines, Top Negative Sentiments by Airline, and Most Common Reasons for Negative sentiment. Below that, the infographic indicates the frequency of Tweets by sentiment over time as well as the percentage of positive, negative and neutral Tweets. Finally, the second column of the infographic, taking up about one fourth of its space, is dedicated to the text used in the Tweets, from the Top Two Negative Retweets to a word cloud that summarizes the Most Common Negative Words used in the Tweets recorded in the data.</p><p>The font usage is minimal, and a san-serif typeface was chosen for readability and scalability. The use of boldface was limited to give the graphics and charts more salience.</p>"
        },
        {
            "title": "Functional Design",
            "detail": "<p>We found in the data provided to us that the majority of these Tweets had negative sentiment, so we wanted to make that clear to the reader. This is therefore reflected the most in the colors used, generally color coding the whole infographic story. Wherever possible, our three colors of blue, light gray and dark gray are used to indicate negative, neutral and positive sentiment. This combination is seen in “Sentiment by Airline,” “Sentiment Over Time,” and “Sentiment Breakdown.”</p><p>However, the two bar charts remaining only use shades of blue, emphasizing the negativity to the Tweets: “Airlines’ Top Reasons for Negative Sentiment” and “Most Common Reasons for Negative Sentiment.” Even the word-based sections of the infographic mostly use blue because they relay information about specific negative Tweets and the words used in them.</p><p>Functionally, the charts within the infographic emphasize compatibility especially in its bar charts: the longer the length, the higher the number of Tweets. Even the “Negative Words” word cloud shows compatibility by having the larger words such as “apology,” “wtf,” and “sucks” indicate that they were more frequently used than the smaller words like “runway,” “disconnected,” and “pilots.”</p><p>Where possible, the infographic aims to provide context to the user. One example is in “Sentiment Over Time,” where we noticed a large spike in negative Tweets on February 22, 2015. A Google search led us to understand that this spike was due to a winter storm that cancelled more than 1000 flights that Sunday. We noted this in the graph itself and even indicated that over half of the negative Tweets that day had to do with Customer Service Issues or Late (or even cancelled) Flights.</p>"
        }
    ]
}