{
    "path": "survivor-infographic",
    "description": "Interaction Design and Information Architecture exercise",
    "content": [
        {
            "title": "Process",
            "detail": "<p>For an Interaction Design and Information Architecture course. I wanted to diagram an infographic about the 30 seasons of the Survivor reality TV show, utilizing the universal design principle of the five hat racks by organizing the show's information by three out of five of the hat racks (a.k.a. LATCH).</p><p>As a long-running TV show, Survivor has had enough data from 2000 to 2015 to warrant an infographic that indicates its film locations and ratings over the years.</p>"
        },
        {
            "title": "Hat Racks Used",
            "detail": "<p>Location: Plot points mark the countries/regions where each season was filmed. Location is a major element of the show and the graphic displays the common areas that the show has covered geographically.</p><p><strong>Hierarchy:</strong> Columns indicate the seasons' ratings over the years. Since the show has been running for 15 years, the graphic shows how its popularity has fared across that time.</p><p><strong>Timeline:</strong> Season Titles are ordered chronologically. The show has been running for 15 years and thus the graphic indicates when each season was filmed in accordance with location.</p><p>The timeline is further useful in how it interacts with the other two \"hats\" used:</p><ul><li><strong>Location/Map:</strong> Numbered circles mark when and where seasons took place on the map.</li><li><strong>Hierarchy/Columns:</strong> Associate rating over the years as they run below the timeline.</li></ul>",
            "images": [
                {
                    "src": "projects/media/survivor/infographic.jpeg",
                    "alt": "Infographic of Survivor season locations",
                    "classes": "align-center",
                    "containerClasses": "mobile-width-100"
                }
            ]
        }
    ]
}