{
    "path": "twitter-interactive-infographic",
    "description": "Information Visualization and Infographics exercise",
    "content": [
        {
            "detail": "<p>For the same infographics class, my partner and I created an information visualization that served additional information to the <a href='/twitter-print-infographic'>print infographic</a> about the <a target='_blank' href='https://www.kaggle.com/datasets/crowdflower/twitter-airline-sentiment'>Tweets sent to or about U.S. Airlines</a>.</p><p>This class was really useful in getting me familiar with ggplot, D3, and Tableau. The visualization was created through Tableau, which you can view below in addition to our essay.</p>",
            "images": [
                {
                    "src": "projects/media/twitter/interactive-infographic.gif",
                    "alt": "Infographic of Twitter sentiment data",
                    "classes": "align-center",
                    "containerClasses": "mobile-width-100"
                }
            ]
        },
        {
            "detail": "<p>We previously created a print infographic about the week in the life of U.S. airline sentiment on Twitter during February 2015. This provided insight into the majority of negative Tweets about selected airlines, especially over the course of a two-day time period. For our interactive visualization, we’re expanding our analysis into how the airlines fared both collectively and individually. The interactive feature of the dashboard allows the user to isolate data by airline, which could not be accomplished in the print version. While airlines are the focal point, the major variables graphed are Tweet sentiment and the number of Tweets. This visualization also introduces geographic locations gathered from the data to break down airline sentiment distribution across the U.S.</p>"
        },
        {
            "title": "What did the designer want me to do with this graphic?",
            "detail": "<p>We want the reader of this visualization to get an in-depth view into the performance of each airline across time, location and sentiment based on the number of Tweets made toward or about them. We also want the reader to have the power to explore the data by allowing them to filter down the information by a particular airline’s performance. Specifically, the questions we wanted to answer were:</p><ul><li>Which airlines receive the most Tweets?</li><li>Which airlines receive the best to worst sentiment?</li><li>What is the distribution of Tweets by sentiment over time?</li><li>What is the distribution of Tweets toward airlines over the selected time period?</li><li>What is the geographic distribution of Tweets for each airline?</li><li>Which states produce the best to worst sentiment?</li></ul><p>The interactive visualization represents several variables across four graphs:</p><ul><li>The <strong>bubble chart of Airlines and their Number of Tweets</strong> is a Ranking and Part-to-Whole graph with the variables of Frequency/Number of Tweets (ratio) and Airline Names (nominal). It shows which airlines received the most Tweets.</li><li>The set of <strong>choropleths of Sentiments by State Across Airlines</strong> is a Ranking, Part-to-Whole, and Nominal Comparison graph with the variables of Frequency/Number of Tweets (ratio), Airline Sentiment (ordinal), Location (nominal), and Airline Names (nominal). It shows which airlines and states received the best to worst sentiment as well as the geographic distribution of Tweets for each airline.</li><li>The <strong>stacked bar chart of Sentiment Types Distributed Across Airlines</strong> is a Ranking graph with the variables of Frequency/Number of Tweets (ratio), Airline Sentiment (ordinal), and Airline Names (nominal). It shows which airlines received the most Tweets as well as the best to worst sentiment.</li><li>The <strong>area chart of Number of Tweets by Sentiment Over Time</strong> is a Time Series and Distribution graph with the variables of Frequency/Number of Tweets (ratio), Airline Sentiment (ordinal), and Date of Tweet (continuous interval). It shows what is the distribution of Tweets toward the airlines over the selected time period.</li></ul>"
        },
        {
            "title": "Audience Connection",
            "detail": "<p>The intended audience includes airline travelers who are familiar with one or several of the U.S. airlines mentioned in the visualization. It also includes Twitter and other social media users who often express their opinions about company services through social media. The reader should understand how Tweets can have a particular positive, neutral or negative sentiment toward the airlines.</p>"
        },
        {
            "title": "Visual Design",
            "detail": "<p>The visualization uses a similar color scheme from the print infographic to depict positive to negative sentiment by utilizing shades of gray and the Twitter brand’s blue. We also decided that the best way for readers to understand the visualization filter by airline was to use significant colors from each airline’s own brand. While the bubble graph may contain several colors, the rest of the charts on the dashboard utilize two major colors. This gives affordance to the user that the bubble graph acts a filtering control and sets the initial focus on the bubble graph.</p><p>The visualization is a horizontal dashboard in a two-column grid. This makes the whole infographic simple to digest at once but more interactive if desired by selecting one of the airline filters. Three of the four graphs include Airline Sentiment as a variable, but the bottom two charts display this information either across airline or time in stack-based graphs.</p><p>The font usage is minimal, and a san-serif typeface was chosen for readability and scalability. The use of boldface was limited to give the graphics and charts more salience.</p>"
        },
        {
            "title": "Functional Design",
            "detail": "<p>The major functional aspect of the interactive visualization is its Airline filter. Readers can choose to view all airlines’ performance at once or select a particular airline to filter down the data for each of the remaining graphs. The separate colors for each airline distinguish the different brands from each other for easier recognition, while the shades of blue and gray function more as resulting data that changes based on the filters applied. If the reader was familiar with our print infographic, the shades of blue and gray also remind the reader of our more general exploration of the Twitter Airline Sentiment data.</p><p>The charts within the infographic emphasize compatibility mostly with the concept that “more is more.” In all four charts, more chart space taken up by a variable indicates more Tweets -- whether the bubbles are larger, more US states have colors, the columns are taller, or the time series areas are larger. The choropleth takes it one step further: the darker the blue or gray within the map, the higher positive or negative Tweet frequency.</p><p>Most importantly, what makes this design useful is the obvious visual changes that happen to the graphs as the reader selects a particular filter, which can entice the reader to dig deeper into the differences. For example, by applying the filters, the reader can notice that the only airlines that received the fewest Tweets on February 22, 2015 are Southwest Airlines and Virgin America. This helps provide more context around the questions we had from our print infographic about who was most likely to cause the influx of Tweets that day and why.</p>"
        },
        {
            "title": "Yi’s Taxonomy",
            "detail": "<p>We combined several interactions in our visualization from Yi’s taxonomy. The first was Select, where we labeled data points so that the reader can hover over them and read more about them. One of our major elements of the visualization was providing single airline Filter so that readers could view the information based on each airline’s performance. This filter revealed how the bubble graph was Connected to the remaining three charts within the visualization. We provided readers the opportunity to Explore the visualization from different perspectives by initially giving them an overall view of the data and a filter to break down each graph’s information by a particular airline. This filter Reconfigured each graph in order to display the information, whether it changed the states highlighted and their sentiment colors, how many bars are shown, or how much area is taken up -- all of which were ways that we Encoded the data. We also provided readers the ability to Abstract or Elaborate within each graph by providing them the ability to focus on particular data elements by clicking on them for isolated focus or zooming in and out of the maps through a zoom control.</p>"
        }
    ]
}